tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationPlatform.cpp
void publishStates(uint32_t nowMs, bool newConnection) {
    IrrigationApp& app = IrrigationApp::instance();
    const IrrigationConfig* config = app.configuration();
    const WateringStatus status = app.wateringStatus();

    if (newConnection) {
        // Full snapshot immediately on a new connection cycle.
        projectOverview(app, status);
        projectRuntime(app, status);
        if (config) {
            projectZones(*config);
            projectZoneMaintenance(*config);
            projectCalibration(*config);
            projectSystemParameters(*config);
            projectPlans(*config);
            projectAutomatic(app);
        }
        projectDiagnostics();
        g_diagnosticsAt = nowMs;
        return;
    }

    projectOverview(app, status);
    projectRuntime(app, status);
    if (config && (status.active || (nowMs - g_stateAt[0]) >= kStatePeriodMs)) {
        static const uint8_t kParameterKeys[] = {0, 1, 2, 3, 4, 5};
        (void)kParameterKeys;
        projectPlans(*config);
        projectAutomatic(app);
    }
    if (config && (nowMs - g_stateAt[1]) >= kStatePeriodMs) {
        projectZones(*config);
        g_stateAt[1] = nowMs;
    }
    if (nowMs - g_diagnosticsAt >= kDiagnosticsPeriodMs) {
        projectDiagnostics();
        g_diagnosticsAt = nowMs;
    }
}

}  // namespace

WateringRecordStore* g_wateringStore = nullptr;
IrrigationAuditStore* g_auditStore = nullptr;
iot_device::RecordStream* g_recordStreams[2] = {};
void bindStores(WateringRecordStore& watering, IrrigationAuditStore& audit) {
    g_wateringStore = &watering;
    g_auditStore = &audit;
    g_recordStreams[0] = &watering.recordStream();
    g_recordStreams[1] = &audit.recordStream();
    g_session.setRecordStreams(g_recordStreams, 2);
}

bool configured() { return g_configured; }

bool configure() {
    if (g_configured) return true;
    if (!buildDeviceId()) {
        g_configureResult = "device_id_unavailable";
        ESP32BASE_LOG_E("irrigation", "platform_device_id_unavailable");
        return false;
    }
    if (IRRIGATION_IOT_MQTT_HOST[0] == '\0' ||
        IRRIGATION_IOT_MQTT_CA_PEM[0] == '\0') {
        g_configureResult = "secrets_empty";
        ESP32BASE_LOG_W("irrigation",
                        "platform_mqtt_unconfigured_local_only");
        return false;
    }

    Esp32BaseMqtt::ConnectionConfig mqttConfig;
    mqttConfig.host = IRRIGATION_IOT_MQTT_HOST;
    mqttConfig.port = IRRIGATION_IOT_MQTT_PORT;
    mqttConfig.security = Esp32BaseMqtt::TLS;
    mqttConfig.username = IRRIGATION_IOT_MQTT_USERNAME;
    mqttConfig.password = IRRIGATION_IOT_MQTT_PASSWORD;
    mqttConfig.tls.caCertificatePem = IRRIGATION_IOT_MQTT_CA_PEM;
    mqttConfig.tls.caCertificateLength =
        std::strlen(IRRIGATION_IOT_MQTT_CA_PEM) + 1;

    if (!g_port.configure(mqttConfig)) {
        g_configureResult = "port_configure_rejected";
        ESP32BASE_LOG_E("irrigation", "platform_mqtt_configure_rejected");
        return false;
    }
    g_configureResult = "ok";
    g_configured = true;
    ESP32BASE_LOG_I("irrigation", "platform_configured device=%s", g_deviceId);
    return true;
}

void begin() {
    if (!g_configured) {
        ESP32BASE_LOG_E("irrigation", "platform_configure_failed reason=%s", g_configureResult);
        return;
    }
    buildBootId();
    if (!g_publisher.begin(ESP32BASE_MQTT_MAX_TOPIC_BYTES,
                           ESP32BASE_MQTT_MAX_PAYLOAD_BYTES)) {
        ESP32BASE_LOG_E("irrigation", "platform_publisher_begin_failed");
    }
}

void poll() {
    if (!g_configured) return;
    g_inbox.begin();
    g_port.poll();
    g_inbox.poll(millis());
    progressPoll();

    iot_device::RecordStream::PublishFact publish = nullptr;
    void* publishCtx = nullptr;
    if (g_session.ready() && !g_stopping) {
        publish = &ModelPublisher::publishRecord;
        publishCtx = &g_publisher;
    }
    // Each store owns its SDK RecordStream and its single local durable store.
    if (g_wateringStore) g_wateringStore->poll(publish, publishCtx);
    if (g_auditStore) g_auditStore->poll(publish, publishCtx);

    if (!g_session.ready() || g_stopping) return;

    const uint32_t now = millis();
    const bool newConnection =
        std::strncmp(g_stateConnection, g_session.connectionId(), 37) != 0;
    if (newConnection) {
        std::strncpy(g_stateConnection, g_session.connectionId(), 36);
        g_stateConnection[36] = '\0';
        g_stateSeq = 0;
    }
    publishStates(now, newConnection);
}

}  // namespace IrrigationPlatform
